Autodesk.DesignScript.Geometry.PolyCurve.ByJoinedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Make PolyCurve by joining curves. Flips curve as needed for connectivity
curves:  Curves to join into polycurve
Returns:
segments,joincurves

Autodesk.DesignScript.Geometry.PolyCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
Make PolyCurve from sequence of lines connecting points. For closed curve last point should be in same location as start point.
points:  Points to make polycurve
connectLastToFirst:  make  close or open polycurve
Returns:
segments,joincurves,lines
0.5,0.5,0.4

Autodesk.DesignScript.Geometry.PolyCurve.Offset(System.Double,System.Boolean)
Offset polycurve in its plane.
distance:
extendCircular:  If true, corners will be made circular
Returns: