Autodesk.DesignScript.Geometry.Surface.BySweep2Rails(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Sweep the cross section curve along a path guided by a two rails
rail1:
rail2:
profile:
Returns:
sweep2,guides

Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve})
Trim the surface with a collection of loops within the surface
loops:
Returns:
trim multiple,removeloops,cutloops