Autodesk.DesignScript.Geometry.Arc.ByFillet(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Double)
Create an arc by filleting twp curves with given radius
curve1:  First curve
curve2:  Second curve
radius:  The radius of the fillet arc
Returns:  An Arc
arc,fillet,round,smooth,arcs

Autodesk.DesignScript.Geometry.Arc.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
best fit arc through points
points:  Points to fit
Returns:
arc,approximate,arcs