Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.Unweld(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge})
Unweld all the given edges, It will unweld each vertex on all the edges.
edges: A set of edges to unweld
Returns: TSpline surface with unwelded edges
tspline,unweld,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.Unweld(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex})
Unweld all the specified vertices. All edges on every vertex will be unwelded.
vertices: A set of vertices to unweld
Returns: TSpline surface with unwelded vertices
tspline,unweld,vertex