Autodesk.DesignScript.Geometry.Curve.Normal
The normal to the plane where the curve is contained.  Only            valid for planar curves.
perpendicular

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtParameter(System.Double)
Get a CoordinateSystem with origin at the point at the given parameter. The XAxis is aligned with the curve normal and the YAxis is aligned with the curve tangent at this point
param:  The parameter at which to evaluate
Returns:  The aligned CoordinateSystem at the point
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.ParameterAtPoint(Autodesk.DesignScript.Geometry.Point)
Get the parameter at a particular point along the Curve
point:  A Point along or near the Curve
Returns:  The closest parameter along the curve
projectpoint,closestparam,curveparam

Autodesk.DesignScript.Geometry.Curve.Offset(System.Double)
Offset a Curve by a specified amount. Curve must be planar, and, if a BSplineCurve/NurbsCurve, must have degree > 1.
distance:  A positive or negative distance to offset
Returns:  new offsetted curves
thicken,lines
0.5,0.4